#+AUTHOR: Paul Hewson
#+TITLE: Work planning
#+EMAIL: paul.hewson@overleaf.com
#+STARTUP: overview

* Core

** Writeful prompts
:LOGBOOK:
CLOCK: [2024-05-21 Tue 07:33]--[2024-05-21 Tue 12:29] =>  4:56
CLOCK: [2024-05-17 Fri 09:18]--[2024-05-17 Fri 17:31] =>  8:13
CLOCK: [2024-05-15 Wed 15:09]--[2024-05-15 Wed 17:18] =>  2:09
:END:

- 15% of clicks paid; conversion from phase 1; how many users 'promo-prompt' click through = 'promo-click' 'writefull-oauth-promotion'
May 2023-2024 name = 'writefull-premium'
- Add a writefull-received-suggestions event as confirmation they logged in.

#+begin_src sql :eval no
  SELECT DISTINCT (SELECT val from UNNEST(segmentation) WHERE key = 'location') AS location
  FROM `mgcp-1117973-ol-prod.analytics.events`
  WHERE event IN ('promo-prompt')
  AND (SELECT val FROM UNNEST(segmentation) WHERE key = 'name') IN ('writefull-oauth-promotion')
  Only value for location is notification
#+end_src


** Track changes
:LOGBOOK:
CLOCK: [2024-06-27 Thu 09:16]--[2024-06-27 Thu 09:28] =>  0:12
CLOCK: [2024-06-12 Wed 12:27]--[2024-06-12 Wed 13:30] =>  1:03
CLOCK: [2024-06-03 Mon 17:39]--[2024-06-03 Mon 17:39] =>  0:00
CLOCK: [2024-05-14 Tue 13:34]--[2024-05-14 Tue 15:24] =>  1:50
:END:
** AI errors
:LOGBOOK:
CLOCK: [2024-06-27 Thu 10:21]--[2024-06-27 Thu 11:22] =>  1:01
CLOCK: [2024-06-12 Wed 15:56]--[2024-06-12 Wed 18:40] =>  2:44
CLOCK: [2024-06-12 Wed 13:30]--[2024-06-12 Wed 14:31] =>  1:01
CLOCK: [2024-06-04 Tue 08:18]--[2024-06-04 Tue 09:23] =>  1:05
CLOCK: [2024-05-31 Fri 07:47]--[2024-05-31 Fri 16:31] =>  8:44
CLOCK: [2024-05-30 Thu 16:17]--[2024-05-30 Thu 17:46] =>  1:29
CLOCK: [2024-05-30 Thu 8:47]--[2024-05-30 Thu 11:00] =>  2:13
CLOCK: [2024-05-29 Wed 11:08]--[2024-05-29 Wed 14:34] =>  3:26
CLOCK: [2024-05-29 Wed 09:57]--[2024-05-29 Wed 10:29] =>  0:32
CLOCK: [2024-05-29 Wed 08:37]--[2024-05-29 Wed 09:56] =>  1:19
CLOCK: [2024-05-28 Tue 09:42]--[2024-05-28 Tue 16:42] =>  7:00
CLOCK: [2024-05-24 Fri 14:01]--[2024-05-24 Fri 16:51] =>  2:50
CLOCK: [2024-05-22 Wed 07:38]--[2024-05-22 Wed 14:46] =>  7:08
CLOCK: [2024-05-21 Tue 15:00]--[2024-05-21 Tue 16:24] =>  1:24
CLOCK: [2024-05-21 Tue 13:41]--[2024-05-21 Tue 14:00] =>  0:19
CLOCK: [2024-05-16 Thu 13:54]--[2024-05-16 Thu 19:30] =>  5:36
CLOCK: [2024-05-16 Thu 08:30]--[2024-05-16 Thu 11:01] =>  2:31
CLOCK: [2024-05-14 Tue 15:24]--[2024-05-14 Tue 18:18] =>  2:54
:END:

- Fake Door test (how many people are interesting in buying an AI feature)

** Cancellations
:LOGBOOK:
CLOCK: [2024-06-03 Mon 17:40]--[2024-06-03 Mon 17:40] =>  0:00
CLOCK: [2024-05-15 Wed 08:18]--[2024-05-15 Wed 14:31] =>  6:13
CLOCK: [2024-05-03 Fri 09:54]--[2024-05-03 Fri 16:47] =>  6:53
CLOCK: [2024-05-03 Fri 08:51]--[2024-05-03 Fri 09:53] =>  1:02
CLOCK: [2024-05-02 Thu 10:32]--[2024-05-02 Thu 11:06] =>  0:34
:END:



** New user churn
:LOGBOOK:
CLOCK: [2024-06-27 Thu 16:14]--[2024-06-27 Thu 17:04] =>  0:50
CLOCK: [2024-06-26 Wed 13:06]--[2024-06-26 Wed 14:40] =>  1:34
CLOCK: [2024-06-26 Wed 07:04]--[2024-06-26 Wed 11:20] =>  4:16
CLOCK: [2024-06-25 Tue 13:09]--[2024-06-25 Tue 17:11] =>  4:02
CLOCK: [2024-06-25 Tue 08:27]--[2024-06-25 Tue 13:06] =>  4:39
:END:

 #+begin_src sql :eval no
  WITH registration_events AS (
    SELECT user_id, REGEXP_CONTAINS(user_id, '^[0-9a-f]{24}$') AS user_not_analytics_id, (SELECT val FROM UNNEST(segmentation) WHERE key = 'method') AS method
    FROM `analytics.events`
    WHERE event = 'register' AND created_at >= '2023-01-01' AND created_at < '2024-01-01'),
  users AS (
    SELECT DISTINCT user_id
    FROM analytics.events
    WHERE logged_in AND analytics.MONGO_ID_TIMESTAMP(user_id) > '2023-01-01' AND analytics.MONGO_ID_TIMESTAMP(user_id) < '2024-01-01'
  )
  SELECT user_not_analytics_id IS NOT NULL AS captured_reg_event, user_not_analytics_id,
         CASE WHEN method = 'orcid' THEN 'orcid'
              WHEN method = 'password' THEN 'password'
              WHEN method = 'google' THEN 'google'
              WHEN method IS NULL THEN 'null'
              ELSE 'noise'
          END AS method_cleaned,  COUNT(DISTINCT user_id) AS n_users
  FROM users
  FULL OUTER JOIN registration_events
  USING(user_id)
  GROUP BY user_not_analytics_id, method_cleaned, captured_reg_event
  ORDER BY 1, 2, 3
#+end_src

#+begin_src sql :eval no
WITH registration_by_user AS (
  SELECT * FROM (
    SELECT user_id, REGEXP_REPLACE(property, "-", "_") AS property, value
    FROM analytics.user_properties
    WHERE property LIKE ('registered-%') AND 
          created_at >= '2022-01-01' AND created_at < '2023-01-01'
    GROUP BY user_id, property, value)
  PIVOT (ARRAY_AGG(value IGNORE NULLS)
    FOR property in ('registered_from_bonus_scheme', "registered_from_collaboration", 'registered_from_commons_account', 'registered_from_link_sharing', 'registered_from_project_invite', "registered-from-open-in-overleaf",
    'registered_from_product_source',
                     'registered_from_product_medium', "registered_from_referrer_direct", "registered_from_referrer_email", "registered_from_referrer_search", 'registered_from_referrer_source','registered_from_referrer_medium', "registered_from_referrer_link",
                     "registered_from_referrer_social", "registered_from_referrer_unknown", "registered_from_template",
                     'registered_from_utm_content', 'registered_from_utm_campaign', 'registered_from_utm_medium', 'registrered_from_utm_source', "registered_from_utm_term")
    )
),
registrations AS (
  SELECT user_id, analytics.MONGO_ID_TIMESTAMP(user_id) AS registered, 
         registered_from_bonus_scheme[offset(0)] AS bonus_scheme, registered_from_commons_account[offset(0)] AS commons_account,
         registered_from_project_invite[offset(0)] AS project_invite, 
         registered_from_referrer_source[offset(0)] AS referrer_source, registered_from_referrer_medium[offset(0)] AS referrer_medium,
         registered_from_product_source[offset(0)] AS product_source, registered_from_product_medium[offset(0)] AS product_medium,
         registered_from_utm_content[offset(0)] AS utm_content, registered_from_utm_campaign[offset(0)] AS utm_campaign,
         registered_from_utm_medium[offset(0)] AS utm_medium, registrered_from_utm_source[offset(0)] AS utm_source
    FROM registration_by_user)
SELECT user_id, bonus_scheme, commons_account, project_invite, REGEXP_EXTRACT(product_source, "[0-9]*") AS template_id, 
       CASE 
         WHEN product_source = 'link-sharing' THEN 'link-sharing'
         WHEN product_source = 'project-invite' THEN 'project-invite'
         WHEN REGEXP_CONTAINS(product_source, "[0-9]*") THEN 'template'
      END AS product_source, product_medium, referrer_source
FROM registrations
#+end_src



** PDF viewer controls
:LOGBOOK:
CLOCK: [2024-06-05 Wed 15:10]--[2024-06-05 Wed 16:56] =>  1:46
CLOCK: [2024-06-04 Tue 09:30]--[2024-06-04 Tue 18:08] =>  8:38
CLOCK: [2024-06-03 Mon 10:57]--[2024-06-03 Mon 17:39] =>  6:42
:END:

- I can only find left menu setting-changed options.

#+begin_src sql :eval no
select (SELECT val FROM UNNEST(segmentation) WHERE key = 'changedSettingVal') AS value, COUNT(DISTINCT user_id) AS n_users
FROM analytics.events
WHERE event = 'setting-changed' AND (SELECT val from UNNEST(segmentation) WHERE key = 'changedSetting') = 'pdfViewer' AND created_at >= '2024-01-01'
GROUP BY value
ORDER BY 2 DESC
#+end_src
*** MEETING with                                                  :MEETING:
:LOGBOOK:
CLOCK: [2024-06-10 Mon 09:19]--[2024-06-10 Mon 09:19] =>  0:00
CLOCK: [2024-06-06 Thu 10:21]--[2024-06-06 Thu 10:24] =>  0:03
:END:
[2024-06-05 Thu 16:31]
- Meeting with Brittany
- Agreed to invite me to future meetings/stand up
- I didn't understand the coherence of the planning document (reducing pdfs, using Overleaf pdf viewer) and the relationship to the proposed events
- Brittany emphasised this is a low risk feature roll out - it sounds like a typical engineering make available to beta and if no-one complains then roll to all. So the success factor is really that the feature works as designed and no-one complains.
- As a side note, it seems to add functionality already available in the website pdf viewer
- The presentation mode is separate. We should monitor how much use that gets, and people's reaction to it

** Uni Toronto
SCHEDULED: <2024-06-06 Thu>
:LOGBOOK:
CLOCK: [2024-06-24 Mon 09:52]--[2024-06-24 Mon 10:22] =>  0:30
CLOCK: [2024-06-14 Fri 07:45]--[2024-06-14 Fri 17:07] =>  9:22
CLOCK: [2024-06-13 Thu 07:41]--[2024-06-13 Thu 18:12] => 10:31
CLOCK: [2024-06-12 Wed 08:36]--[2024-06-12 Wed 11:08] =>  2:32
CLOCK: [2024-06-11 Tue 08:22]--[2024-06-11 Tue 16:22] =>  8:00
CLOCK: [2024-06-10 Mon 16:01]--[2024-06-10 Mon 17:27] =>  1:26
CLOCK: [2024-06-10 Mon 0:49]--[2024-06-10 Mon 11:06] => 10:17
CLOCK: [2024-06-07 Fri 07:47]--[2024-06-07 Fri 17:56] => 10:09
CLOCK: [2024-06-06 Thu 15:53]--[2024-06-06 Thu 17:48] =>  1:55
CLOCK: [2024-06-06 Thu 11:59]--[2024-06-06 Thu 14:56] =>  2:57
CLOCK: [2024-06-06 Thu 10:24]--[2024-06-06 Thu 11:58] =>  1:34
CLOCK: [2024-06-06 Thu 08:58]--[2024-06-06 Thu 10:21] =>  1:23
:END:
- Number of collaborators / number of projects

So, I can run this query and get in the ballpark

#+begin_src sql :eval no
WITH edited_projects AS (
  SELECT MIN(started_at) AS start_date, SUM(EXTRACT(DAY FROM duration) * 24 + EXTRACT(HOUR FROM duration) + EXTRACT(MINUTE FROM duration) / 60 + EXTRACT(SECOND FROM duration) / 3600) AS editing_time, project_id, user_id
  FROM analytics.editing_sessions
  WHERE started_at >= '2024-06-13' AND started_at < '2024-06-14'
  GROUP BY project_id, user_id
 ),
 current_toronto_affiliate AS (
   SELECT DISTINCT user_id
    FROM `analytics.affiliation_episodes`
    WHERE name = 'University of Toronto' AND episode_to IS NULL
 )
SELECT COUNT(DISTINCT project_id) AS n_projects, COUNT(DISTINCT user_id) AS n_users
FROM edited_projects
WHERE user_id in (SELECT user_id FROM current_toronto_affiliate)
#+end_src

I can change the dates and get plausibly close to what we see here: [[https://www.overleaf.com/institutions/944/hub][v1 metrics]]

I can't match the collaborations.

#+begin_src sql :eval no
WITH edited_projects AS (
  SELECT MIN(started_at) AS start_date, SUM(EXTRACT(DAY FROM duration) * 24 + EXTRACT(HOUR FROM duration) + EXTRACT(MINUTE FROM duration) / 60 + EXTRACT(SECOND FROM duration) / 3600) AS editing_time, project_id, user_id
  FROM analytics.editing_sessions
  WHERE started_at >= '2023-01-01' AND started_at < '2024-01-01'
  GROUP BY project_id, user_id
 ),
 current_toronto_affiliate AS (
   SELECT DISTINCT user_id
    FROM `analytics.affiliation_episodes`
    WHERE name = 'University of Toronto' AND episode_to IS NULL
 ),
 toronto_user_projects AS (
  SELECT DISTINCT project_id, owner_id, collab_id as user_id, collab_type, 'toronto_owner' AS owner
  FROM (
    SELECT id AS project_id, owner_id, collab_id, 'rw' AS collab_type
    FROM `analytics.raw_projects`, UNNEST(readwrite_user_ids) AS collab_id
    UNION ALL
    SELECT id AS project_id, owner_id, collab_id, 'ls_rw' AS collab_type
    FROM `analytics.raw_projects`, UNNEST(link_sharing_readwrite_user_ids) AS collab_id
    WHERE owner_id IN (SELECT user_id FROM current_toronto_affiliate)
  )
  ),
 toronto_collab_projects AS (
  SELECT DISTINCT project_id, owner_id AS user_id, collab_type, 'toronto_collab' AS owner
  FROM (
    SELECT id AS project_id, owner_id, collab_id, 'rw' AS collab_type
    FROM `analytics.raw_projects`, UNNEST(readwrite_user_ids) AS collab_id
    UNION ALL
    SELECT id AS project_id, owner_id, collab_id, 'ls_rw' AS collab_type
    FROM `analytics.raw_projects`, UNNEST(link_sharing_readwrite_user_ids) AS collab_id
    WHERE collab_id IN (SELECT user_id FROM current_toronto_affiliate)
  )
  )
SELECT name, country_code, collab_type, owner, COUNT(DISTINCT project_id) AS n_projects, COUNT(DISTINCT user_id) AS n_users, SUM(editing_time) AS editing_time_hours
FROM (SELECT project_id, user_id, collab_type, owner FROM toronto_user_projects UNION ALL SELECT project_id, user_id, collab_type, owner FROM toronto_collab_projects) p
INNER JOIN edited_projects
USING(user_id, project_id)
LEFT JOIN (SELECT user_id, name FROM analytics.affiliation_episodes WHERE episode_to IS NULL)
USING(user_id)
LEFT JOIN analytics.current_universities
USING(name)
WHERE owner = 'toronto_owner'
GROUP BY name, country_code, collab_type, owner
ORDER BY n_users DESC
#+end_src


This is much closer to a match

#+begin_src sql :eval no
WITH  current_toronto_affiliate AS (
   SELECT DISTINCT user_id
    FROM `analytics.affiliation_episodes`
    WHERE name = 'University of Toronto' AND episode_to IS NULL
 ),
edited_projects AS (
  SELECT MIN(started_at) AS start_date, SUM(EXTRACT(DAY FROM duration) * 24 + EXTRACT(HOUR FROM duration) + EXTRACT(MINUTE FROM duration) / 60 + EXTRACT(SECOND FROM duration) / 3600) AS editing_time, project_id, s.user_id
  FROM analytics.editing_sessions s
  WHERE started_at >= '2024-05-01' AND started_at < '2024-06-01'
  GROUP BY project_id, user_id
  HAVING editing_time > 0
 ),

 toronto_user_projects AS (
  SELECT DISTINCT project_id
  FROM edited_projects
  WHERE user_id in (SELECT user_id FROM current_toronto_affiliate)
  )
SELECT names[0], country_code, COUNT(DISTINCT project_id) AS n_projects, COUNT(DISTINCT user_id) AS n_users, SUM(editing_time) AS editing_time_hours
FROM edited_projects
LEFT JOIN (SELECT user_id, ARRAY_AGG(name ORDER BY episode_from DESC) AS names FROM analytics.affiliation_episodes WHERE episode_to IS NULL GROUP BY user_id) 
USING(user_id)
LEFT JOIN analytics.current_universities
ON name = names[0]
WHERE project_id IN (SELECT project_id FROM toronto_user_projects)
GROUP BY names[0], country_code
ORDER BY n_users DESC
#+end_src

* Meetings

** All hands type stuff
:LOGBOOK:
CLOCK: [2024-06-26 Wed 15:33]--[2024-06-26 Wed 16:58] =>  1:25
:END:

** Data team meetings

:LOGBOOK:
CLOCK: [2024-06-27 Thu 11:22]--[2024-06-27 Thu 13:05] =>  1:43
CLOCK: [2024-06-26 Wed 11:20]--[2024-06-26 Wed 13:06] =>  1:46
CLOCK: [2024-06-12 Wed 11:08]--[2024-06-12 Wed 12:27] =>  1:19
CLOCK: [2024-06-06 Thu 10:58]--[2024-06-06 Thu 11:59] =>  1:01
CLOCK: [2024-06-05 Wed 10:30]--[2024-06-05 Wed 15:10] =>  4:40
CLOCK: [2024-05-30 Thu 11:19]--[2024-05-30 Thu 13:15] =>  1:56
CLOCK: [2024-05-30 Thu 11:00]--[2024-05-30 Thu 11:18] =>  0:18
CLOCK: [2024-05-29 Wed 10:30]--[2024-05-29 Wed 11:08] =>  0:38
CLOCK: [2024-05-16 Thu 11:01]--[2024-05-16 Thu 13:54] =>  2:53
CLOCK: [2024-05-15 Wed 14:31]--[2024-05-15 Wed 15:09] =>  0:38
CLOCK: [2024-05-02 Thu 11:06]--[2024-05-02 Thu 16:54] =>  5:48
CLOCK: [2024-04-18 Thu 11:17]--[2024-04-18 Thu 12:48] =>  1:31
CLOCK: [2024-04-17 Wed 10:58]--[2024-04-17 Wed 11:36] =>  0:38
CLOCK: [2024-04-17 Wed 10:57]--[2024-04-17 Wed 10:57] =>  0:00
:END:

Labels and review process for github SIs. analytics-metrics is label for any analytics work, team-analytics implies one of us needs to do something. Need to find right places to manage process involving analytics work.

** DS retreat
:LOGBOOK:
CLOCK: [2024-05-22 Wed 14:46]--[2024-05-22 Wed 17:35] =>  2:49
:END:

** Product/Support meetings
:LOGBOOK:
CLOCK: [2024-06-26 Wed 14:40]--[2024-06-26 Wed 15:33] =>  0:53
CLOCK: [2024-06-12 Wed 14:31]--[2024-06-12 Wed 15:56] =>  1:25
CLOCK: [2024-05-29 Wed 14:34]--[2024-05-29 Wed 17:14] =>  2:40
CLOCK: [2024-04-30 Tue 08:47]--[2024-04-30 Tue 17:15] =>  8:28
CLOCK: [2024-04-17 Wed 14:55]--[2024-04-17 Wed 17:16] =>  2:21
CLOCK: [2024-04-17 Wed 14:38]--[2024-04-17 Wed 14:54] =>  0:16
:END:

*** Support 15th May

- Support allocations sorted
- Overleaf connection test page would be helpful, D MacK would like more than websocket tests
- Git integration - have I been pawned delivers 500 error, should we stop encouraging password access to git. JLM thinks work is done, we just need to flip the switch (gradually, to limit support demand)
- Updating based on CTAN content e.g. mapping of packages and functions e.g. for auto complete. Time to update mapping? Commands, environments and packages themselves).  e.g DTX generates code and docs

*** Support 29th May
- 503 git errors, google suggest something to do with VPNs
- Readcube integration - lots of concern that they aren't very good at LaTeX
*** Support 12th June
- Link share webinars need to be aware of changes to functionality
- Trial hacking - limit ability to extend trials (one only) and how often you can start a trial (e.g., one trial per year).
- Something about account suspension
- How long should gradual rollouts be (for catching mistakes); avoid big increase on Friday.
- 403 errors still seem to be google fault
- Worrying about accessibility of editor - they do get asked questions about this and aren't sure they are giving optimal answers. Rebekah and Jess have been working on this - watch this space. Don't understand legal compliance; JLM to run cross-checks. It's OK to give different answers to real users.
- Readcube integration. Do we want out own Bibtex conversion from Readcube API - but RC are interested in the write-and-cite workflow (via the enterprise API).
- New pdf viewers about to be released.




*** Support 26th June
- Pondering incident calling options (e.g., platform down needs people woken, fake trial extensions don't)
- Support worrying about greyed out toolbar (writefull) on Overleaf and generally about Writefull rushing to release features that haven't been tested by Overleaf support (features developed based on data analysis not Overleaf support customer feedback).
***** Support 10/07/2024
- Lots of complaints about link sharing. Removing ability to comment via read-only is generating lots of complaints and can't see the upside.  What is the free plan for (students/developing world)? Don't have a narrative to explain why these changes are being made.
Complaints that we are going to remove collaborators. Support not convinced free plan is a viable option.However, also stated that not many people affected hence little public negative feedback.
** Cycle planning meetings
*** 10th June 2024
:LOGBOOK:
CLOCK: [2024-06-10 Mon 12:05]--[2024-06-10 Mon 16:01] =>  3:56
:END:
- Reference management shaping; want to shape a write and cite tool
  - Full project in client (e.g., full project search, auto-completion) 
 - Design and improvements to editor (review panel) - tech debt (can we increase the limit on the number of changes you can track, e.g., request from CERN)
- Delivery backlog
- AI error correction - to be launched next week (?) to labs
 - Split tests: default new beginner users to visual editor - this week
 - When a user inserts a table they get a suggestion to use the visual editor to get a preview of the table. Split test? Or measure the impact of the notification.
 - pdf viewer controls.
 - New user churn
 - Live equation preview (premium feature) or convert image to LaTeX
 - Some attention given to collaboration UX (e.g., a list of regular collaborators)
 - Post meeting: rm prompts test /
   - Success in core
   - AI error correction coverage.



** One to ones/skip meetings
:LOGBOOK:
CLOCK: [2024-06-24 Mon 10:22]--[2024-06-24 Mon 17:14] =>  6:52
CLOCK: [2024-06-10 Mon 11:06]--[2024-06-10 Mon 12:05] =>  0:59
CLOCK: [2024-06-03 Mon 09:56]--[2024-06-03 Mon 10:57] =>  1:01
:END:
[[cite:&berk10_what_you_can_cant_proper]]

** Email sunk time
:LOGBOOK:
CLOCK: [2024-04-17 Wed 12:21]--[2024-04-17 Wed 12:23] =>  0:02
CLOCK: [2024-04-17 Wed 12:18]--[2024-04-17 Wed 12:18] =>  0:00
:END:


* Personal admin

** INPROGRESS SFHEA application [1/5]
- State "INPROGRESS" from              [2024-04-17 Wed 13:18]
- [X] Information pack
- [ ] Ask about booking on course (costs 735)
- [ ] Book on course
- [ ] Sort out my National Association stuff
- [ ] Check in with David about MARM
  
** READY Manim animations [1/6]
:LOGBOOK:
CLOCK: [2024-04-18 Thu 16:48]--[2024-04-18 Thu 18:11] =>  1:23
CLOCK: [2024-04-18 Thu 12:48]--[2024-04-18 Thu 16:48] =>  4:00
:END:
- State "READY"      from              [2024-04-17 Wed 13:19]
- [X] Correlation as the angle between two vectors
- [ ] Correlation requires unit vectors
- [ ] Correlation algebra
- [ ] Transformation from scatterplot to x, y vector geometry
- [ ] Non-transitive correlation
- [ ] Least squares as project problem
- manim -pql scene.py CreateCircle




** READY Concept tests in statistics
- State "READY"      from              [2024-04-17 Wed 13:21]
- [ ] Expand question bank
** TODO Assertion reason tests in Statistics
** TODO AI in education [1/1]
- [ ] Talk on 18th
** Org mode [[https://github.com/james-stoup/emacs-org-mode-tutorial][org-tutorial]] [[https://doc.norang.ca/org-mode.html][Norangdoc]]

** Exercism

uname -m
wget ex.....
tar -xvzf exercism-3.2.0-linux-x86_64.tar.gz 

exercism configure --token=02816b7b-227a-407c-b79c-fa7e79b2ecec

sudo apt-get install build-essential
sudo apt-get install cmake
sudo apt-get install libboost-all-dev

~/Downloads/exercism download --track=cpp --exercise=last-will

mkdir build
cd build
cmake -G "Unix Makefiles"  -DEXERCISM_RUN_ALL_TESTS=1 ..
make

~/Downloads/exercism submit ../last_will.cpp

BATS_RUN_SKIPPED=true bats test-raindrops.batss

  
** Blogging

** Domestic


* LaTeX

- [ ] LaTeX language tool https://github.com/valentjn/ltex-ls
- [ ] Float control [[https://robjhyndman.com/hyndsight/latex-floats/][Rob Hyndman]]
      Why it's difficult [[https://aty.sdsu.edu/bibliog/latex/floats.html][SDSU]]
- [ ] Line 33 of doc-settings.sty \captionsetup*{labelformat=simple}

* Emacs
** WAIT Git cloning blog
#+begin_src bash :eval no
  git submodule sync
  git submodule update --init --recursive

  cd public
  git fetch --all
  cd ..
  
  cd public
  git checkout 21c85a84c7c3c82d58994c86f5e55935112ac4a8
#+end_src

I think that last git checkout 21etc. was part of the fix. I don't think I've captured the whole fix.

- State "WAIT"       from              [2024-06-07 Fri 09:51]
** DONE Compile from source (treesitter) [0/1]
- State "WAIT"       from              [2024-04-17 Wed 12:00]
- [X] Configure compile options ./configure --with-cairo --with-xwidgets --with-x-toolkit=gtk3 --with-tree-sitter --with-json
- [ ] Find out why I have text only toolbar on dev
** DONE Enhancing current setup [3/3]
SCHEDULED: <2024-04-17 Wed>
- State "INPROGRESS" from              [2024-04-17 Wed 12:00]
:LOGBOOK:
CLOCK: [2024-04-17 Wed 11:51]--[2024-04-17 Wed 12:21] =>  0:30
CLOCK: [2024-04-17 Wed 11:49]--[2024-04-17 Wed 11:51] =>  0:02
CLOCK: [2024-04-17 Wed 09:41]--[2024-04-17 Wed 10:09] =>  0:28
:END:
- [X] Rewrite org, partition out emails and org configs
- [X] Calc mode (setq calc-embedded-info nil)
- [X] [[http://pragmaticemacs.com/][Pragmatic emacs]]

** WAIT Outstanding mysteries [1/2]
- State "WAIT"       from "WAIT"       [2024-05-30 Thu 11:24]
- State "WAIT"       from              [2024-04-17 Wed 12:00]
- [ ] what is planner.org</users> all about and how do I get out of sync?
- [X] Org agenda / planner not playing together nicely.
  

** WAIT email [0/4]
- State "WAIT"       from              [2024-04-17 Wed 12:00]
- [ ] Get gnus working again?
- [ ] gnus/bbdb interaction
- [ ] org-gcal-sync doesn't work.
   https://github.com/myuhe/org-gcal.el/issues/73
      I *think* org-gcal-fetch is writing to the schedule.org file as 644 rw-r--r-- and /cannot/ subsequently _write more_. +Currently+ fixed by deleting and touching the file.   Look at
solution involving chmod next time (if I remember). R_{sub} R^{sup} \alpha - [ ] Check all the security issues I've opened up
- [ ] Can I import work dates into personal diary.

** INPROGRESS Recapture [0/2]
- State "INPROGRESS" from              [2024-04-17 Wed 12:00]
- [ ] ORG refile, don't understand capture task and refile
- [ ] Org capture direct from browser?

** WAIT Things I thought I understood once [5/6]
- State "WAIT"       from              [2024-04-17 Wed 12:00]
- [X] [[https://stackoverflow.com/questions/6874516/relative-line-numbers-in-emacs][Relative line numbers]]
- [X] Move files in dired+  Alt-0 w (gets abs filename), Ctrl-y pastes.
- [X] Rename files in dired. Ctrl-x Ctrl-q to get dired edit mode. Ctrl-c Ctrl-c to commit.
- [X] Dos2unix    C-x C-m f (or C-x RET f)    .emacs is set up to want utf8 unix
- [X] Stow.  ~stow stow_directory/package target_directory~
  By default, ~stow_directory~ is folder in which ~stow~ is called.
  By default, ~target_directory~ is the parent folder of current folder
  So you can specify ~-t \~/~
  There is also a dry-run flag ~-n~, and a verbosity flag ~-v~ through ~-vvv~
- [ ] diff <(jq -S . a.json) <(jq -S . b.json) diff two json files.
- [ ] gif-screencast. Needs imagemagick, scrot and gifsicle, also needs a bit of config
** INPROGRESS org-roam (was Journaling) [0/1]
- State "INPROGRESS" from              [2024-04-17 Wed 12:00]
- [ ] Journal mode https://github.com/bastibe/org-journal

** READY Languagues [1/3]
- State "READY"      from              [2024-04-17 Wed 12:01]
- [ ] Langtool https://github.com/mhayashi1120/Emacs-langtool
- [ ] Flycheck language tool https://github.com/emacs-languagetool/flycheck-languagetool
https://github.com/mhayashi1120/Emacs-langtool
' `+ Lingva-translate
- [X] Use reverso (I did, but I think you can't use the API anymore)


** TODO Why can't i install reveal.js and what is xaringan
:LOGBOOK:
CLOCK: [2024-05-03 Fri 09:53]--[2024-05-03 Fri 09:54] =>  0:01
:END:
[2024-05-03 Fri 09:53]
* Summary

** Effort

#+BEGIN: columnview :hlines 2 :id global :maxlevel 4 :scope agenda
| Task                                 | Effort | CLOCKSUM |
|--------------------------------------+--------+----------|
| Core                                 |        |  2d 5:44 |
|--------------------------------------+--------+----------|
| Track changes                        |        |     1:50 |
|--------------------------------------+--------+----------|
| AI errors                            |        | 1d 13:12 |
|--------------------------------------+--------+----------|
| Cancellations                        |        |    14:42 |
|--------------------------------------+--------+----------|
| Meetings                             |        |    15:13 |
|--------------------------------------+--------+----------|
| Data team meetings                   |        |    12:24 |
|--------------------------------------+--------+----------|
| DS retreat                           |        |     2:49 |
|--------------------------------------+--------+----------|
| Product/Support meetings             |        |  1d 5:05 |
|--------------------------------------+--------+----------|
| Support 15th May                     |        |          |
|--------------------------------------+--------+----------|
| Support 29th May                     |        |          |
|--------------------------------------+--------+----------|
| Writeful prompts                     |        |    15:18 |
|--------------------------------------+--------+----------|
| One to ones/skip meetings            |        |          |
|--------------------------------------+--------+----------|
| Email sunk time                      |        |     0:02 |
|--------------------------------------+--------+----------|
| Personal admin                       |        |     5:23 |
|--------------------------------------+--------+----------|
| SFHEA application                    |        |          |
|--------------------------------------+--------+----------|
| Manim animations                     |        |     5:23 |
|--------------------------------------+--------+----------|
| Concept tests in statistics          |        |          |
|--------------------------------------+--------+----------|
| Assertion reason tests in Statistics |        |          |
|--------------------------------------+--------+----------|
| AI in education                      |        |          |
|--------------------------------------+--------+----------|
| Org mode [[https://github.com/james-stoup/emacs-org-mode-tutorial][org-tutorial]] [[https://doc.norang.ca/org-mode.html][Norangdoc]]      |        |          |
|--------------------------------------+--------+----------|
| Exercism                             |        |          |
|--------------------------------------+--------+----------|
| Blogging                             |        |          |
|--------------------------------------+--------+----------|
| Domestic                             |        |          |
|--------------------------------------+--------+----------|
| LaTeX                                |        |          |
|--------------------------------------+--------+----------|
| Emacs                                |        |     1:00 |
|--------------------------------------+--------+----------|
| Compile from source (treesitter)     |        |          |
|--------------------------------------+--------+----------|
| Enhancing current setup              |        |     1:00 |
|--------------------------------------+--------+----------|
| Outstanding mysteries                |        |          |
|--------------------------------------+--------+----------|
| email                                |        |          |
|--------------------------------------+--------+----------|
| Recapture                            |        |          |
|--------------------------------------+--------+----------|
| Things I thought I understood once   |        |          |
|--------------------------------------+--------+----------|
| Journaling                           |        |          |
|--------------------------------------+--------+----------|
| Languagues                           |        |          |
|--------------------------------------+--------+----------|
| Summary                              |        |          |
|--------------------------------------+--------+----------|
| Effort                               |        |          |
|--------------------------------------+--------+----------|
| Today                                |        |          |
|--------------------------------------+--------+----------|
| This week                            |        |          |
#+END:

** Today
#+BEGIN: clocktable :block today :maxlevel 4 :scope agenda
#+CAPTION: Clock summary at [2023-04-13 Thu 09:15], for Thursday, April 13, 2023.
| File                | Headline              | Time |      |
|---------------------+-----------------------+------+------|
|                     | ALL *Total time*        | *1:38* |      |
|---------------------+-----------------------+------+------|
| planner.org         | *File time*             | *1:38* |      |
|                     | Split tests           | 1:38 |      |
|                     | \_  Onboarding videos |      | 1:38 |
|---------------------+-----------------------+------+------|
| schedule.org        | *File time*             | *0:00* |      |
|---------------------+-----------------------+------+------|
| github_projects.org | *File time*             | *0:00* |      |
#+END:

** This week
#+BEGIN: clocktable :block thisweek :maxlevel 4
#+CAPTION: Clock summary at [2023-04-14 Fri 17:02], for week 2023-W15.
| Headline                                     |    Time |      |
|----------------------------------------------+---------+------|
| *Total time*                                   | *1d 4:13* |      |
|----------------------------------------------+---------+------|
| Meetings                                     |    3:49 |      |
| \_  Product team meetings                    |         | 1:00 |
| \_  Data team meetings                       |         | 2:11 |
| \_  Email sunk time                          |         | 0:38 |
| Split tests                                  |    8:54 |      |
| \_  Onboarding videos                        |         | 8:38 |
| \_  Chosen by Overleaf                       |         | 0:16 |
| User profiles                                |   15:30 |      |
| \_  Develop point of subscription query  [/] |         | 0:45 |
| \_  Classification                           |         | 9:09 |
| \_  Planning                                 |         | 5:36 |
#+END:





